/*********************************************************/
/*  main.c                                               */
/*                                                       */
/*  階層型ニューロネットプログラム                       */
/*  学習機                                               */
/*  畳み込みとプーリング処理                             */
/*                                                       */
/*  Usage:                                               */
/*  # main < data1.txt                                   */
/*********************************************************/
#include "lrnproc.h"

int main(){
	
	return lrnproc();
	
}


